HarshAnne/HarshBoot/libs/ch32v003/ch32v003harsh.h
#elif defined(__TASKING__)
  #define __ASM       __asm   /*!< asm keyword for TASKING Compiler      */
  #define __INLINE    inline  /*!< inline keyword for TASKING Compiler   */

#endif


#ifdef __cplusplus
 extern "C" {
#endif
	
#ifndef __ASSEMBLER__

/* Standard Peripheral Library old types (maintained for legacy purpose) */
typedef __I uint32_t vuc32;  /* Read Only */
typedef __I uint16_t vuc16;  /* Read Only */
typedef __I uint8_t vuc8;   /* Read Only */

typedef const uint32_t uc32;  /* Read Only */
typedef const uint16_t uc16;  /* Read Only */
typedef const uint8_t uc8;   /* Read Only */

typedef __I int32_t vsc32;  /* Read Only */
typedef __I int16_t vsc16;  /* Read Only */
typedef __I int8_t vsc8;   /* Read Only */

typedef const int32_t sc32;  /* Read Only */
typedef const int16_t sc16;  /* Read Only */
typedef const int8_t sc8;   /* Read Only */

typedef __IO uint32_t  vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef uint32_t  u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef __IO int32_t  vs32;
typedef __IO int16_t  vs16;
typedef __IO int8_t   vs8;

typedef int32_t  s32;
typedef int16_t s16;
typedef int8_t  s8;

#if defined(CH32V20x) || defined(CH32V30x)
typedef __I uint64_t vuc64;  /* Read Only */
typedef const uint64_t uc64;  /* Read Only */
typedef __I int64_t vsc64;  /* Read Only */
typedef const int64_t sc64;  /* Read Only */
typedef __IO uint64_t  vu64;
typedef uint64_t  u64;
typedef __IO int64_t  vs64;
typedef int64_t  s64;
#endif

typedef enum {NoREADY = 0, READY = !NoREADY} ErrorStatus;

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;

#define   RV_STATIC_INLINE  static  inline

/* memory mapped structure for Program Fast Interrupt Controller (PFIC) */
typedef struct{
    __I  uint32_t ISR[8];
    __I  uint32_t IPR[8];
    __IO uint32_t ITHRESDR;
    __IO uint32_t RESERVED;
    __IO uint32_t CFGR;
    __I  uint32_t GISR;
    __IO uint8_t VTFIDR[4];
    uint8_t RESERVED0[12];
    __IO uint32_t VTFADDR[4];
    uint8_t RESERVED1[0x90];
    __O  uint32_t IENR[8];
    uint8_t RESERVED2[0x60];
    __O  uint32_t IRER[8];
    uint8_t RESERVED3[0x60];
    __O  uint32_t IPSR[8];
    uint8_t RESERVED4[0x60];
    __O  uint32_t IPRR[8];
    uint8_t RESERVED5[0x60];
    __IO uint32_t IACTR[8];
    uint8_t RESERVED6[0xE0];
    __IO uint8_t IPRIOR[256];
    uint8_t RESERVED7[0x810];
    __IO uint32_t SCTLR;
}PFIC_Type;

#endif

/* some bit definitions for systick regs */
#define SYSTICK_SR_CNTIF (1<<0)
#define SYSTICK_CTLR_STE (1<<0)
#define SYSTICK_CTLR_STIE (1<<1)
#define SYSTICK_CTLR_STCLK (1<<2)
#define SYSTICK_CTLR_STRE (1<<3)
#define SYSTICK_CTLR_SWIE (1<<31)

#define PFIC            ((PFIC_Type *) PFIC_BASE )
#define NVIC            PFIC
#define NVIC_KEY1       ((uint32_t)0xFA050000)
#define	NVIC_KEY2	    ((uint32_t)0xBCAF0000)
#define	NVIC_KEY3		((uint32_t)0xBEEF0000)


#define SysTick         ((SysTick_Type *) SysTick_BASE)

#ifndef __ASSEMBLER__

/*********************************************************************
 * @fn      __enable_irq
 *
 * @brief   Enable Global Interrupt
 *
 * @return  none
 */
RV_STATIC_INLINE void __enable_irq()
{
	uint32_t result;

	__ASM volatile(
#if __GNUC__ > 10
		".option arch, +zicsr\n"
#endif
		"csrr %0," "mstatus": "=r"(result));
	result |= 0x88;
	__ASM volatile ("csrw mstatus, %0" : : "r" (result) );
}

/*********************************************************************
 * @fn      __disable_irq
 * @brief   Disable Global Interrupt
 * @return  none
 */
RV_STATIC_INLINE void __disable_irq()
{
	uint32_t result;

    __ASM volatile(
#if __GNUC__ > 10
		".option arch, +zicsr\n"
#endif
		"csrr %0," "mstatus": "=r"(result));
	result &= ~0x88;
	__ASM volatile ("csrw mstatus, %0" : : "r" (result) );
}

/*********************************************************************
 * @fn      __isenabled_irq
 * @brief   Is Global Interrupt enabled
 * @return  1: yes, 0: no
 */
RV_STATIC_INLINE uint8_t __isenabled_irq(void)
{
    uint32_t result;

    __ASM volatile(
#if __GNUC__ > 10
    ".option arch, +zicsr\n"
#endif
    "csrr %0," "mstatus": "=r"(result));
    return (result & 0x08) != 0u;
}

/*********************************************************************
 * @fn      __get_cpu_sp
 * @brief   Get stack pointer
 * @return  stack pointer
 */
RV_STATIC_INLINE uint32_t __get_cpu_sp(void);
RV_STATIC_INLINE uint32_t __get_cpu_sp(void)
{
	uint32_t result;

	__ASM volatile(
#if __GNUC__ > 10
    ".option arch, +zicsr\n"
#endif
	"mv %0, sp" : "=r"(result));
	return result;
}

/*********************************************************************
 * @fn      __NOP
 * @brief   nop
 * @return  none
 */
RV_STATIC_INLINE void __NOP()
{
	__ASM volatile ("nop");
}

/*********************************************************************
 * @fn       NVIC_EnableIRQ
 * @brief   Disable Interrupt
 * @param   IRQn - Interrupt Numbers
 * @return  none
 */
RV_STATIC_INLINE void NVIC_EnableIRQ(IRQn_Type IRQn)
{
	NVIC->IENR[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F));
}

/*********************************************************************
 * @fn       NVIC_DisableIRQ
 * @brief   Disable Interrupt
 * @param   IRQn - Interrupt Numbers
 * @return  none
 */
RV_STATIC_INLINE void NVIC_DisableIRQ(IRQn_Type IRQn)
{
	NVIC->IRER[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F));
}

/*********************************************************************
 * @fn       NVIC_GetStatusIRQ
 * @brief   Get Interrupt Enable State
 * @param   IRQn - Interrupt Numbers
 * @return  1 - 1: Interrupt Pending Enable
 *                0 - Interrupt Pending Disable
 */
RV_STATIC_INLINE uint32_t NVIC_GetStatusIRQ(IRQn_Type IRQn)
{
	return((uint32_t) ((NVIC->ISR[(uint32_t)(IRQn) >> 5] & (1 << ((uint32_t)(IRQn) & 0x1F)))?1:0));
}

/*********************************************************************
 * @fn      NVIC_GetPendingIRQ
 * @brief   Get Interrupt Pending State
 * @param   IRQn - Interrupt Numbers
 * @return  1 - 1: Interrupt Pending Enable
 *                0 - Interrupt Pending Disable
 */
RV_STATIC_INLINE uint32_t NVIC_GetPendingIRQ(IRQn_Type IRQn)
{
	return((uint32_t) ((NVIC->IPR[(uint32_t)(IRQn) >> 5] & (1 << ((uint32_t)(IRQn) & 0x1F)))?1:0));
}

/*********************************************************************
 * @fn      NVIC_SetPendingIRQ
 * @brief   Set Interrupt Pending
 * @param   IRQn - Interrupt Numbers
 * @return  none
 */
RV_STATIC_INLINE void NVIC_SetPendingIRQ(IRQn_Type IRQn)
{
	NVIC->IPSR[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F));
}

/*********************************************************************
 * @fn      NVIC_ClearPendingIRQ
 * @brief   Clear Interrupt Pending
 * @param   IRQn - Interrupt Numbers
 * @return  none
 */
RV_STATIC_INLINE void NVIC_ClearPendingIRQ(IRQn_Type IRQn)
{
	NVIC->IPRR[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F));
}

/*********************************************************************
 * @fn      NVIC_GetActive
 * @brief   Get Interrupt Active State
 * @param   IRQn - Interrupt Numbers
 * @return  1 - Interrupt Active
 */
RV_STATIC_INLINE uint32_t NVIC_GetActive(IRQn_Type IRQn)
{
	return((uint32_t)((NVIC->IACTR[(uint32_t)(IRQn) >> 5] & (1 << ((uint32_t)(IRQn) & 0x1F)))?1:0));
}

/*********************************************************************
 * @fn      NVIC_SetPriority
 *
 * @brief   Set Interrupt Priority
 *
 * @param   IRQn - Interrupt Numbers
 *          priority: bit7 - pre-emption priority
 *                    bit6 - subpriority
 *                    bit[5-0] - reserved
 *
 * @return  none
 */
RV_STATIC_INLINE void NVIC_SetPriority(IRQn_Type IRQn, uint8_t priority)
{
	NVIC->IPRIOR[(uint32_t)(IRQn)] = priority;
}

/*********************************************************************
 * SUSPEND ALL INTERRUPTS EXCEPT
 * The following 3 functions serve to suspend all interrupts, except for the one you momentarily need.
 * The purpose of this is to not disturb the one interrupt of interest and let it run unimpeded.
 * procedure:
 * 1. save the enabled IRQs: uint32_t IRQ_backup = NVIC_get_enabled_IRQs();
 * 2. disable all IRQs: NVIC_clear_all_IRQs_except(IRQ_of_interest);
 * 3. restore the previously enabled IRQs: NVIC_restore_IRQs(IRQ_backup);
 * 
 * bit layout of the IRQ backup
 * bit		0 | 1 | 2  |  3  | 4  |  5  | 6  .. 22 | 23 .. 28
 * IRQn		2 | 3 | 12 | res | 14 | res | 16 .. 31 | 32 .. 38
 * IRQn 2 and 3 aren't actually user-settable (see RM).
 * 
 * Specifying an invalid IRQn_to_keep like 0 will disable all interrupts.
 */

RV_STATIC_INLINE uint32_t NVIC_get_enabled_IRQs()
{
	return ( ((NVIC->ISR[0] >> 2) & 0b11) | ((NVIC->ISR[0] >> 12) << 2) | ((NVIC->ISR[1] & 0b1111111) << 23) );
}

RV_STATIC_INLINE void NVIC_clear_all_IRQs_except(uint8_t IRQn_to_keep)
{
	if (!(IRQn_to_keep >> 5)) {		// IRQn_to_keep < 32
		NVIC->IRER[0] = (~0) & (~(1 << IRQn_to_keep));
		NVIC->IRER[1] = (~0);
	}
	else {
		IRQn_to_keep = IRQn_to_keep >> 5;
		NVIC->IRER[0] = (~0);
		NVIC->IRER[1] = (~0) & (~(1 << IRQn_to_keep));
	}
}

RV_STATIC_INLINE void NVIC_restore_IRQs(uint32_t old_state)
{
	NVIC->IENR[0] = (old_state >> 2) << 12;
	NVIC->IENR[1] = old_state >> 23;
}

/*********************************************************************
 * @fn       __WFI
 * @brief   Wait for Interrupt
 * @return  none
 */
__attribute__( ( always_inline ) ) RV_STATIC_INLINE void __WFI(void)
{
	NVIC->SCTLR &= ~(1<<3);   // wfi
	__ASM volatile ("wfi");
}

/*********************************************************************
 * @fn       __WFE
 * @brief   Wait for Events
 * @return  none
 */
__attribute__( ( always_inline ) ) RV_STATIC_INLINE void __WFE(void)
{
  uint32_t t;

  t = NVIC->SCTLR;
  NVIC->SCTLR |= (1<<3)|(1<<5);     // (wfi->wfe)+(__sev)
  NVIC->SCTLR = (NVIC->SCTLR & ~(1<<5)) | ( t & (1<<5));
  __ASM volatile ("wfi");
  __ASM volatile ("wfi");
}

/*********************************************************************
 * @fn      SetVTFIRQ
 * @brief   Set VTF Interrupt
 * @param   addr - VTF interrupt service function base address.
 *                  IRQn - Interrupt Numbers
 *                  num - VTF Interrupt Numbers
 *                  NewState -  DISABLE or ENABLE
 *
 * @return  none
 */
RV_STATIC_INLINE void SetVTFIRQ(uint32_t addr, IRQn_Type IRQn, uint8_t num, FunctionalState NewState){
	if(num > 1)  return ;

	if (NewState != DISABLE)
	{
		NVIC->VTFIDR[num] = IRQn;
		NVIC->VTFADDR[num] = ((addr&0xFFFFFFFE)|0x1);
	}
	else{
		NVIC->VTFIDR[num] = IRQn;
		NVIC->VTFADDR[num] = ((addr&0xFFFFFFFE)&(~0x1));
	}
}

/*********************************************************************
 * @fn       NVIC_SystemReset
 * @brief   Initiate a system reset request
 * @return  none
 */
RV_STATIC_INLINE void NVIC_SystemReset(void)
{
  NVIC->CFGR = NVIC_KEY3|(1<<7);
}

// For configuring INTSYSCR, for interrupt nesting + hardware stack enable.
static inline uint32_t __get_INTSYSCR(void)
{
	uint32_t result;
	__ASM volatile("csrr %0, 0x804": "=r"(result));
	return (result);
}

static inline void __set_INTSYSCR( uint32_t value )
{
    __ASM volatile("csrw 0x804, %0" : : "r"(value));
}

#if defined(CH32V30x)
/*********************************************************************
 * @fn      __get_FFLAGS
 *
 * @brief   Return the Floating-Point Accrued Exceptions
 *
 * @return  fflags value
 */
static inline uint32_t __get_FFLAGS(void)
{
	uint32_t result;
	__ASM volatile ( "csrr %0," "fflags" : "=r" (result) );
	return (result);
}

/*********************************************************************
 * @fn      __set_FFLAGS
 * @brief   Set the Floating-Point Accrued Exceptions
 * @param   value  - set FFLAGS value
 * @return  none
 */
static inline void __set_FFLAGS(uint32_t value)
{
	__ASM volatile ("csrw fflags, %0" : : "r" (value) );
}

/*********************************************************************
 * @fn      __get_FRM
 * @brief   Return the Floating-Point Dynamic Rounding Mode
 * @return  frm value
 */
static inline uint32_t __get_FRM(void)
{
	uint32_t result;
	__ASM volatile ( "csrr %0," "frm" : "=r" (result) );
	return (result);
}

/*********************************************************************
 * @fn      __set_FRM
 * @brief   Set the Floating-Point Dynamic Rounding Mode
 * @param   value  - set frm value
 * @return  none
 */
static inline void __set_FRM(uint32_t value)
{
	__ASM volatile ("csrw frm, %0" : : "r" (value) );
}

/*********************************************************************
 * @fn      __get_FCSR
 * @brief   Return the Floating-Point Control and Status Register
 * @return  fcsr value
 */
static inline uint32_t __get_FCSR(void)
{
	uint32_t result;
	__ASM volatile ( "csrr %0," "fcsr" : "=r" (result) );
	return (result);
}

/*********************************************************************
 * @fn      __set_FCSR
 * @brief   Set the Floating-Point Dynamic Rounding Mode
 * @param   value  - set fcsr value
 * @return  none
 */
static inline void __set_FCSR(uint32_t value)
{
	__ASM volatile ("csrw fcsr, %0" : : "r" (value) );
}

#endif // CH32V30x

/*********************************************************************
 * @fn      __get_MSTATUS
 * @brief   Return the Machine Status Register
 * @return  mstatus value
 */
static inline uint32_t __get_MSTATUS(void)
{
	uint32_t result;
	__ASM volatile("csrr %0," "mstatus": "=r"(result));
	return (result);
}

/*********************************************************************
 * @fn      __set_MSTATUS
 * @brief   Set the Machine Status Register
 * @param   value  - set mstatus value
 * @return  none
 */
static inline void __set_MSTATUS(uint32_t value)
{
	__ASM volatile("csrw mstatus, %0" : : "r"(value));
}

/*********************************************************************
 * @fn      __get_MISA
 * @brief   Return the Machine ISA Register
 * @return  misa value
 */
static inline uint32_t __get_MISA(void)
{
	uint32_t result;
	__ASM volatile("csrr %0,""misa" : "=r"(result));
	return (result);
}

/*********************************************************************
 * @fn      __set_MISA
 * @brief   Set the Machine ISA Register
 * @param   value  - set misa value
 * @return  none
 */
static inline void __set_MISA(uint32_t value)
{
	__ASM volatile("csrw misa, %0" : : "r"(value));
}

/*********************************************************************
 * @fn      __get_MTVEC
 *
 * @brief   Return the Machine Trap-Vector Base-Address Register
 *
 * @return  mtvec value
 */
static inline uint32_t __get_MTVEC(void)
{
	uint32_t result;
	__ASM volatile("csrr %0," "mtvec": "=r"(result));
	return (result);
}

/*********************************************************************
 * @fn      __set_MTVEC
 * @brief   Set the Machine Trap-Vector Base-Address Register
 * @param   value  - set mtvec value
 * @return  none
 */
static inline void __set_MTVEC(uint32_t value)
{
	__ASM volatile("csrw mtvec, %0":: "r"(value));
}

/*********************************************************************
 * @fn      __get_MSCRATCH
 * @brief   Return the Machine Seratch Register
 * @return  mscratch value
 */
static inline uint32_t __get_MSCRATCH(void)
{
	uint32_t result;
	__ASM volatile("csrr %0," "mscratch" : "=r"(result));
	return (result);
}

/*********************************************************************
 * @fn      __set_MSCRATCH
 * @brief   Set the Machine Seratch Register
 * @param   value  - set mscratch value
 * @return  none
 */
static inline void __set_MSCRATCH(uint32_t value)
{
	__ASM volatile("csrw mscratch, %0" : : "r"(value));
}

/*********************************************************************
 * @fn      __get_MEPC
 * @brief   Return the Machine Exception Program Register
 * @return  mepc value
 */
static inline uint32_t __get_MEPC(void)
{
    uint32_t result;

	__ASM volatile("csrr %0," "mepc" : "=r"(result));
    return (result);
}

/*********************************************************************
 * @fn      __set_MEPC
 * @brief   Set the Machine Exception Program Register
 * @return  mepc value
 */
static inline void __set_MEPC(uint32_t value)
{
	__ASM volatile("csrw mepc, %0" : : "r"(value));
}

/*********************************************************************
 * @fn      __get_MCAUSE
 * @brief   Return the Machine Cause Register
 * @return  mcause value
 */
static inline uint32_t __get_MCAUSE(void)
{
    uint32_t result;

	__ASM volatile("csrr %0," "mcause": "=r"(result));
    return (result);
}

/*********************************************************************
 * @fn      __set_MCAUSE
 * @brief   Set the Machine Cause Register
 * @return  mcause value
 */
static inline void __set_MCAUSE(uint32_t value)
{
	__ASM volatile("csrw mcause, %0":: "r"(value));
}

#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)

/*********************************************************************
 * @fn      __get_MTVAL
 * @brief   Return the Machine Trap Value Register
 * @return  mtval value
 */
static inline uint32_t __get_MTVAL(void)
{
	uint32_t result;

	__ASM volatile ( "csrr %0," "mtval" : "=r" (result) );
	return (result);
}

/*********************************************************************
 * @fn      __set_MTVAL
 * @brief   Set the Machine Trap Value Register
 * @return  mtval value
 */
static inline void __set_MTVAL(uint32_t value)
{
	__ASM volatile ("csrw mtval, %0" : : "r" (value) );
}

#endif

/*********************************************************************
 * @fn      __get_MVENDORID
 * @brief   Return Vendor ID Register
 * @return  mvendorid value
 */
static inline uint32_t __get_MVENDORID(void)
{
	uint32_t result;
	__ASM volatile("csrr %0,""mvendorid": "=r"(result));
	return (result);
}

/*********************************************************************
 * @fn      __get_MARCHID
 * @brief   Return Machine Architecture ID Register
 * @return  marchid value
 */
static inline uint32_t __get_MARCHID(void)
{
	uint32_t result;

	__ASM volatile("csrr %0,""marchid": "=r"(result));
	return (result);
}

/*********************************************************************
 * @fn      __get_MIMPID
 * @brief   Return Machine Implementation ID Register
 * @return  mimpid value
 */
static inline uint32_t __get_MIMPID(void)
{
	uint32_t result;
	__ASM volatile("csrr %0,""mimpid": "=r"(result));
	return (result);
}

/*********************************************************************
 * @fn      __get_MHARTID
 * @brief   Return Hart ID Register
 * @return  mhartid value
 */
static inline uint32_t __get_MHARTID(void)
{
	uint32_t result;
	__ASM volatile("csrr %0,""mhartid": "=r"(result));
	return (result);
}

/*********************************************************************
 * @fn      __get_SP
 * @brief   Return SP Register
 * @return  SP value
 */
static inline uint32_t __get_SP(void)
{
	uint32_t result;
	__ASM volatile("mv %0,""sp": "=r"(result):);
	return (result);
}

#endif

#ifdef __cplusplus
}
#endif

#endif/* __CORE_RISCV_H__ */


